<?php

return [

    'cars_per_page' => 18,

    'inquiries_per_page' => 12,

    'news_per_page' => 8,

    'car_info' => [

        'color' => [

            1 => ['hex' => '#ffefd5', 'name' => 'Бежевый'],
            2 => ['hex' => '#ffffff', 'name' => 'Белый'],
            3 => ['hex' => '#0088ff', 'name' => 'Голубой'],
            4 => ['hex' => '#fde910', 'name' => 'Желтый'],
            5 => ['hex' => '#34ba2b', 'name' => 'Зеленый'],
            6 => ['hex' => '#FFCC00', 'name' => 'Золотой'],
            7 => ['hex' => '#926547', 'name' => 'Коричневый'],
            8 => ['hex' => '#FF0000', 'name' => 'Красный'],
            9 => ['hex' => '#FF9966', 'name' => 'Оранжевый'],
            10 => ['hex' => '#CC0033', 'name' => 'Пурпурный'],
            11 => ['hex' => '#FFC0CB', 'name' => 'Розовый'],
            12 => ['hex' => '#CACECB', 'name' => 'Серебряный'],
            13 => ['hex' => '#9c9999', 'name' => 'Серый'],
            14 => ['hex' => '#0000FF', 'name' => 'Синий'],
            15 => ['hex' => '#9966CC', 'name' => 'Фиолетовый'],
            16 => ['hex' => '#000000', 'name' => 'Черный'],
        ],

        'gear' => [

            1 => "Задний",
            2 => "Передний",
            3 => "Полный",
        ],

        'transmission' => [

            1 => "Автомат",
            2 => "Механика",
        ],

        'engine' => [

            1 => "Бензин",
            2 => "Дизенль",
            3 => "Гибрид",
            4 => "Бензин / Газ",
            5 => "Электро",
        ],

        'rudder' => [

            1 => "Левый",
            2 => "Правый",
        ],

        'capacity' => [

            1 => 0.2,
            2 => 0.4,
            3 => 0.6,
            4 => 0.9,
            5 => 1.0,
            6 => 1.2,
            7 => 1.4,
            8 => 1.6,
            9 => 1.8,
            10 => 2.0,
            11 => 2.2,
            12 => 2.4,
            13 => 2.6,
            14 => 2.8,
            15 => 3.0,
            16 => 3.5,
            17 => 4.0,
            18 => 4.5,
            19 => 5.0,
            20 => 5.5,
            21 => 6.0,
            22 => 6.5,
            23 => 7.0,
            24 => 7.5,
            25 => 8.0,
            26 => 8.5,
            27 => 9.0,
            28 => 9.5,
            29 => 10.0,
        ],

        'state' => [

            1 => "Новое",
            2 => "Хорошее",
            3 => "Битая на ходу",
            4 => "Битая не на ходу",
        ],

        'owners' => [

            1 => "1",
            2 => "не более 2",
            3 => "не более 3",
            4 => "Более 3",
        ],
    ],

];